# 选股器 ver 1.0
# 2019.05.16

stock.raw <- read.table("~/Desktop/Data/Stock/Cash Flow.csv", head = T, 
sep = ",")
names(stock.raw)
# [1] "证券代码"                                                    
# [2] "证券名称"                                                    
# [3] "报告期股息率..报告期.去年年报..交易日期.2019.05.06..单位.."  
# [4] "经营活动产生的现金流量净额.净利润..报告期.2015年年报..单位.."
# [5] "经营活动产生的现金流量净额.净利润..报告期.2016年年报..单位.."
# [6] "经营活动产生的现金流量净额.净利润..报告期.2017年年报..单位.."
# [7] "经营活动产生的现金流量净额.净利润..报告期.2018年年报..单位.."
# [8] "营业总收入同比增长率..报告期.今年一季..单位.."               
# [9] "总市值..交易日期.2019.05.06..单位.亿元"                      
# [10] "市盈率.PE.TTM...交易日期.2019.05.06"                         
# [11] "现金净流量同比增长率..报告期.2016年年报..单位.."             
# [12] "现金净流量同比增长率..报告期.2017年年报..单位.."             
# [13] "现金净流量同比增长率..报告期.2018年年报..单位.." 

stock <- 0
# 1. 确保稳定的现金流(最近4年): 经营活动产生的现金流量净额 > 归属母公司的净利润.
# 2. 确保现金流增长(最近3年): 经营活动产生的现金流量净额增速 > 0.
# 3. 营收增长(2019年1季度): 营收增幅 > 20%.
# 4. 大盘股: 市值 >= 100亿元.
for (i in 1:nrow(stock.raw)) {
  if (stock.raw[i, 7] > 0 & stock.raw[i, 6] > 0 & stock.raw[i, 5] > 0 
  & stock.raw[i, 4] > 0
      & stock.raw[i, 13] > 0 & stock.raw[i, 12] > 0 & stock.raw[i, 11] > 0
      & stock.raw[i, 8] > 20
      & stock.raw[i, 9] >= 100) 
    {stock <- c(stock, i)}
}
stock <- stock[-1]
stock # 股票序列
length(stock) # 股票数量

for (i in 1:length(stock)) {
  print(stock.raw[stock[i], 2])
}